<H1>My heating system has parameters that are not supported in the software yet, can I help adding these parameters?</H1>

Yes, you can :)! All you need is to connect your Arduino to a Laptop/PC while it is connected to your heating system and follow these steps:

1. Start the Arduino IDE and turn on the serial monitor
2. Enable logging to the serial console and turn on verbose output with the URL-Parameters /M1 and /V1 respectively on the Arduino, e.g. http://192.168.1.50/1234/M1 and http://192.168.1.50/1234/V1
3. On the heating system, switch to the parameter you want to analyze (using the command wheel, arrows or whatever input mode your heating system has).
4. Wait for "silence" on the bus and then switch forward one parameter and then back again to the parameter you want. You should now have something like this on the log:

DISP->HEIZ QUR      113D305F
DC 8A 00 0B 06 3D 11 30 5F AB EC
HEIZ->DISP ANS      113D305F 00 00
DC 80 0A 0D 07 11 3D 30 5F 00 00 03 A1 
DISP->HEIZ QUR      113D3063
DC 8A 00 0B 06 3D 11 30 63 5C 33
HEIZ->DISP ANS      113D3063 00 00 16
DC 80 0A 0E 07 11 3D 30 63 00 00 16 AD 0B 

The first four lines are from the parameter you switched forward to, the last four lines are from the parameter you want to analyze (doing the switching back and forth only makes sure that the last message on the bus is really the parameter you are looking for).
Each data telegram has the following structure:

1st byte: always 0xDC (start of telegram)
2nd byte: source (0x00 = heating system, 0x06 = room device 1, 0x07 = room device 2, 0x0A = display, 0x7F = all)
3rd byte: destination (same values as source)
4th byte: telegram length (start-of-telegram byte (0xDC) is not counted)
5th byte: message type (0x02 = info, 0x03 = set, 0x04 = ack, 0x05 = nack, 0x06 = query, 0x07 = answer, 0x08 = error)
Byte 6-9: Command ID (that's what we're interested in!)
Byte 10...: Return values (only in type "answer")
Last two bytes: CRC checksum

5. The last four lines above have the command ID 0x113D3063. Please note that the first two bytes of the command ID are switched in message type "query" (0x06), so make sure you look at the right telegram (last line in this example).
6. Look up the "global command table" section in file BSB_lan_defs.h and check whether an entry for this command already exists (search for STRxxxx where xxxx is the parameter number). If it does exist, replace the CMD_UNKNOWN with the command ID you just found. If the return value type (column 3) is VT_UNKNOWN try and find out which parameter type from the list at the beginning of the file works. For example, if the parameter should return a temperature value, you can try VT_TEMP, VT_TEMP_SHORT, VT_TEMP_SHORT5 or VT_TEMP_WORD. If the web interface gives you the same value as is displayed on the heating system, everything is ok.
7. If your parameter is not yet listed in the "global command table", you have to add an entry in the "menu strings" section like this:
const char STRxxxx[] PROGMEM = "Parameter_Name_or_Function";
Likewise, you have to add a a line in the "global command table" section, for example by copying another one and then fill out / replace the respective values.

